SpenceKonde/ATTinyCore/avr/boards.txt
attinyx7opti.name=ATtiny167/87 (Optiboot)
attinyx7opti.upload.maximum_data_size=512
attinyx7opti.upload.protocol=arduino
attinyx7opti.upload.tool=avrdude
attinyx7opti.build.board=AVR_ATTINYX7
attinyx7opti.bootloader.tool=avrdude
attinyx7opti.bootloader.unlock_bits=0xFF
attinyx7opti.bootloader.lock_bits=0xFF
attinyx7opti.build.core=tiny
attinyx7opti.bootloader.extended_fuses=0xFE
attinyx7opti.menu.chip.167=ATtiny167
attinyx7opti.menu.chip.167.build.mcu=attiny167
attinyx7opti.menu.chip.167.upload.maximum_size=15744
attinyx7opti.menu.chip.87=ATtiny87
attinyx7opti.menu.chip.87.build.mcu=attiny87
attinyx7opti.menu.chip.87.upload.maximum_size=7552
attinyx7opti.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}.hex
attinyx7opti.menu.clock.8internal=8 MHz (internal)
attinyx7opti.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx7opti.menu.clock.8internal.build.f_cpu=8000000L
attinyx7opti.menu.clock.8internal.upload.speed=57600
attinyx7opti.menu.clock.16external=16 MHz (external)
attinyx7opti.menu.clock.16external.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.16external.build.f_cpu=16000000L
attinyx7opti.menu.clock.16external.upload.speed=115200
attinyx7opti.menu.clock.12external=12 MHz (external)
attinyx7opti.menu.clock.12external.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.12external.build.f_cpu=12000000L
attinyx7opti.menu.clock.12external.upload.speed=115200
attinyx7opti.menu.clock.8external=8 MHz (external)
attinyx7opti.menu.clock.8external.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.8external.build.f_cpu=8000000L
attinyx7opti.menu.clock.8external.upload.speed=57600
attinyx7opti.menu.bod.disable=B.O.D. Disabled
attinyx7opti.menu.bod.disable.bootloader.high_fuses=0xD7
attinyx7opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx7opti.menu.bod.1v8.bootloader.high_fuses=0xD6
attinyx7opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx7opti.menu.bod.2v7.bootloader.high_fuses=0xD5
attinyx7opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx7opti.menu.bod.4v3.bootloader.high_fuses=0xD4
attinyx7opti.menu.pinmapping.new=New style (down each side)
attinyx7opti.menu.pinmapping.new.build.variant=tinyX7_New
attinyx7opti.menu.pinmapping.old=Old style (SCL on 13)
attinyx7opti.menu.pinmapping.old.build.variant=tinyX7




attinyx61.name=ATtiny261/461/861
attinyx61.upload.maximum_size=8192
attinyx61.upload.maximum_data_size=512
attinyx61.upload.tool=avrdude
attinyx61.build.board=AVR_ATTINYX61
attinyx61.bootloader.tool=avrdude
attinyx61.bootloader.unlock_bits=0x03
attinyx61.bootloader.lock_bits=0x03
attinyx61.build.mcu=attiny861
attinyx61.build.core=tiny
attinyx61.menu.TimerClockSource.default=CPU
attinyx61.menu.TimerClockSource.pll=64MHz
attinyx61.menu.TimerClockSource.pll.build.extra_flags=-DPLLTIMER1
attinyx61.menu.TimerClockSource.lowpll=32MHz
attinyx61.menu.TimerClockSource.lowpll.build.extra_flags=-DLOWPLLTIMER1
attinyx61.menu.chip.861=ATtiny861
attinyx61.menu.chip.861.build.mcu=attiny861
attinyx61.menu.chip.861.upload.maximum_size=8192
attinyx61.menu.chip.861.upload.maximum_data_size=512
attinyx61.menu.chip.461=ATtiny461
attinyx61.menu.chip.461.build.mcu=attiny461
attinyx61.menu.chip.461.upload.maximum_size=4096
attinyx61.menu.chip.461.upload.maximum_data_size=256
attinyx61.menu.chip.261=ATtiny261
attinyx61.menu.chip.261.build.mcu=attiny261
attinyx61.menu.chip.261.upload.maximum_size=2048
attinyx61.menu.chip.261.upload.maximum_data_size=128
attinyx61.bootloader.extended_fuses=0x01
attinyx61.menu.clock.8internal=8 MHz (internal)
attinyx61.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx61.menu.clock.8internal.build.f_cpu=8000000L
attinyx61.menu.clock.8internal.bootloader.file=empty/empty_all.hex
attinyx61.menu.clock.20external=20 MHz (external)
attinyx61.menu.clock.20external.bootloader.low_fuses=0xFF
attinyx61.menu.clock.20external.build.f_cpu=20000000L
attinyx61.menu.clock.20external.bootloader.file=empty/empty_all.hex
attinyx61.menu.clock.16external=16 MHz (external)
attinyx61.menu.clock.16external.bootloader.low_fuses=0xFF
attinyx61.menu.clock.16external.build.f_cpu=16000000L
attinyx61.menu.clock.16external.bootloader.file=empty/empty_all.hex
attinyx61.menu.clock.16pll=16 MHz (PLL)
attinyx61.menu.clock.16pll.bootloader.low_fuses=0xF1
attinyx61.menu.clock.16pll.build.f_cpu=16000000L
attinyx61.menu.clock.16pll.bootloader.file=empty/empty_all.hex
attinyx61.menu.clock.12external=12 MHz (external)
attinyx61.menu.clock.12external.bootloader.low_fuses=0xFF
attinyx61.menu.clock.12external.build.f_cpu=12000000L
attinyx61.menu.clock.12external.bootloader.file=empty/empty_all.hex
attinyx61.menu.clock.8external=8 MHz (external)
attinyx61.menu.clock.8external.bootloader.low_fuses=0xFF
attinyx61.menu.clock.8external.build.f_cpu=8000000L
attinyx61.menu.clock.8external.bootloader.file=empty/empty_all.hex
attinyx61.menu.clock.6external=6 MHz (external)
attinyx61.menu.clock.6external.bootloader.low_fuses=0xFD
attinyx61.menu.clock.6external.build.f_cpu=6000000L
attinyx61.menu.clock.6external.bootloader.file=empty/empty_all.hex
attinyx61.menu.clock.4external=4 MHz (external)
attinyx61.menu.clock.4external.bootloader.low_fuses=0xFD
attinyx61.menu.clock.4external.build.f_cpu=4000000L
attinyx61.menu.clock.4external.bootloader.file=empty/empty_all.hex
attinyx61.menu.clock.1internal=1 MHz (internal)
attinyx61.menu.clock.1internal.bootloader.low_fuses=0x62
attinyx61.menu.clock.1internal.build.f_cpu=1000000L
attinyx61.menu.clock.1internal.bootloader.file=empty/empty_all.hex
attinyx61.menu.bod.disable=B.O.D. Disabled
attinyx61.menu.bod.disable.bootloader.high_fuses=0xD7
attinyx61.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx61.menu.bod.1v8.bootloader.high_fuses=0xD6
attinyx61.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx61.menu.bod.2v7.bootloader.high_fuses=0xD5
attinyx61.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx61.menu.bod.4v3.bootloader.high_fuses=0xD4
attinyx61.build.variant=tinyX61


attinyx41.name=ATtiny441/841 (No bootloader)
attinyx41.upload.tool=avrdude
attinyx41.bootloader.tool=avrdude
attinyx41.bootloader.unlock_bits=0xFF
attinyx41.bootloader.lock_bits=0xFF
attinyx41.build.core=tinymodern
attinyx41.build.board=AVR_ATTINYX41
attinyx41.menu.chip.841=ATtiny841
attinyx41.menu.chip.841.build.mcu=attiny841
attinyx41.menu.chip.841.upload.maximum_size=8192
attinyx41.menu.chip.841.upload.maximum_data_size=512
attinyx41.menu.chip.441=ATtiny441
attinyx41.menu.chip.441.build.mcu=attiny441
attinyx41.menu.chip.441.upload.maximum_size=4096
attinyx41.menu.chip.441.upload.maximum_data_size=256
attinyx41.menu.clock.8internal=8 MHz (internal)
attinyx41.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx41.menu.clock.8internal.build.f_cpu=8000000L
attinyx41.menu.clock.8internal.bootloader.file=empty/empty_all.hex
attinyx41.menu.clock.16external=16 MHz (external)
attinyx41.menu.clock.16external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.16external.build.f_cpu=16000000L
attinyx41.menu.clock.16external.bootloader.file=empty/empty_all.hex
attinyx41.menu.clock.12external=12 MHz (external)
attinyx41.menu.clock.12external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.12external.build.f_cpu=12000000L
attinyx41.menu.clock.12external.bootloader.file=empty/empty_all.hex
attinyx41.menu.clock.8external=8 MHz (external)
attinyx41.menu.clock.8external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.8external.build.f_cpu=8000000L
attinyx41.menu.clock.8external.bootloader.file=empty/empty_all.hex
attinyx41.menu.clock.737external=7.372 MHz (external)
attinyx41.menu.clock.737external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.737external.build.f_cpu=7372800L
attinyx41.menu.clock.737external.bootloader.file=empty/empty_all.hex
attinyx41.menu.clock.92external=9.216 MHz (external)
attinyx41.menu.clock.92external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.92external.build.f_cpu=9216000L
attinyx41.menu.clock.92external.bootloader.file=empty/empty_all.hex
attinyx41.menu.clock.11external=11.0592 MHz (external)
attinyx41.menu.clock.11external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.11external.build.f_cpu=11059200L
attinyx41.menu.clock.11external.bootloader.file=empty/empty_all.hex
attinyx41.menu.clock.14external=14.7456 MHz (external)
attinyx41.menu.clock.14external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.14external.build.f_cpu=14745600L
attinyx41.menu.clock.14external.bootloader.file=empty/empty_all.hex
attinyx41.menu.clock.184external=18.432 MHz (external - overclocked)
attinyx41.menu.clock.184external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.184external.build.f_cpu=18432000L
attinyx41.menu.clock.184external.bootloader.file=empty/empty_all.hex
attinyx41.menu.clock.1internal=1 MHz (internal)
attinyx41.menu.clock.1internal.bootloader.low_fuses=0x62
attinyx41.menu.clock.1internal.build.f_cpu=1000000L
attinyx41.menu.clock.1internal.bootloader.file=empty/empty_all.hex
attinyx41.menu.clock.20external=20 MHz (external - overclocked)
attinyx41.menu.clock.20external.bootloader.low_fuses=0xEE
attinyx41.menu.clock.20external.build.f_cpu=20000000L
attinyx41.menu.clock.20external.bootloader.file=empty/empty_all.hex
attinyx41.menu.clock.6external=6 MHz (external)
attinyx41.menu.clock.6external.bootloader.low_fuses=0xED
attinyx41.menu.clock.6external.build.f_cpu=6000000L
attinyx41.menu.clock.6external.bootloader.file=empty/empty_all.hex
attinyx41.menu.clock.4external=4 MHz (external)
attinyx41.menu.clock.4external.bootloader.low_fuses=0xED
attinyx41.menu.clock.4external.build.f_cpu=4000000L
attinyx41.menu.clock.4external.bootloader.file=empty/empty_all.hex
attinyx41.menu.bod.disable=B.O.D. Disabled
attinyx41.menu.bod.disable.bootloader.extended_fuses=0xFF
attinyx41.menu.bod.disable.bootloader.high_fuses=0xD7
attinyx41.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx41.menu.bod.1v8.bootloader.extended_fuses=0xED
attinyx41.menu.bod.1v8.bootloader.high_fuses=0xD7
attinyx41.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx41.menu.bod.2v7.bootloader.extended_fuses=0xED
attinyx41.menu.bod.2v7.bootloader.high_fuses=0xD5
attinyx41.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx41.menu.bod.4v3.bootloader.extended_fuses=0xED
attinyx41.menu.bod.4v3.bootloader.high_fuses=0xD4


attiny841opti.name=ATtiny841 (Optiboot)
attiny841opti.upload.protocol=arduino
attiny841opti.upload.maximum_size=7552
attiny841opti.upload.maximum_data_size=512
attiny841opti.upload.tool=avrdude
attiny841opti.bootloader.tool=avrdude
attiny841opti.bootloader.unlock_bits=0xFF
attiny841opti.bootloader.lock_bits=0xFF
attiny841opti.build.mcu=attiny841
attiny841opti.build.core=tinymodern
attiny841opti.build.board=AVR_ATTINY841_OPTIBOOT
attiny841opti.bootloader.extended_fuses=0xFE
attiny841opti.bootloader.high_fuses=0xD7
attiny841opti.menu.clock.8internal=8 MHz (internal)
attiny841opti.menu.clock.8internal.bootloader.low_fuses=0xE2
attiny841opti.menu.clock.8internal.build.f_cpu=8000000L
attiny841opti.menu.clock.8internal.bootloader.file=optiboot/optiboot_attiny841at8.hex
attiny841opti.menu.clock.8internal.upload.speed=57600
attiny841opti.menu.clock.16external=16 MHz (external)
attiny841opti.menu.clock.16external.bootloader.low_fuses=0xEE
attiny841opti.menu.clock.16external.build.f_cpu=16000000L
attiny841opti.menu.clock.16external.bootloader.file=optiboot/optiboot_attiny841at16.hex
attiny841opti.menu.clock.16external.upload.speed=115200
attiny841opti.menu.clock.12external=12 MHz (external)
attiny841opti.menu.clock.12external.bootloader.low_fuses=0xEE
attiny841opti.menu.clock.12external.build.f_cpu=12000000L
attiny841opti.menu.clock.12external.bootloader.file=optiboot/optiboot_attiny841at12.hex
attiny841opti.menu.clock.12external.upload.speed=115200
attiny841opti.menu.clock.8external=8 MHz (external)
attiny841opti.menu.clock.8external.bootloader.low_fuses=0xEE
attiny841opti.menu.clock.8external.build.f_cpu=8000000L
attiny841opti.menu.clock.8external.bootloader.file=optiboot/optiboot_attiny841at8.hex
attiny841opti.menu.clock.8external.upload.speed=57600
attiny841opti.menu.clock.8internal5v=8 MHz (internal, Vcc > 4v)
attiny841opti.menu.clock.8internal5v.bootloader.low_fuses=0xE2
attiny841opti.menu.clock.8internal5v.build.f_cpu=8200000L
attiny841opti.menu.clock.8internal5v.bootloader.file=optiboot/optiboot_attiny841at8_5v.hex
attiny841opti.menu.clock.8internal5v.upload.speed=57600
attiny841opti.menu.clock.737external=7.3728 MHz (external)
attiny841opti.menu.clock.737external.bootloader.low_fuses=0xEE
attiny841opti.menu.clock.737external.build.f_cpu=7372800L
attiny841opti.menu.clock.737external.bootloader.file=optiboot/optiboot_attiny841at732.hex
attiny841opti.menu.clock.737external.upload.speed=57600
attiny841opti.menu.clock.921external=9.216 MHz (external)
attiny841opti.menu.clock.921external.bootloader.low_fuses=0xEE
attiny841opti.menu.clock.921external.build.f_cpu=9216000L
attiny841opti.menu.clock.921external.bootloader.file=optiboot/optiboot_attiny841at921.hex
attiny841opti.menu.clock.921external.upload.speed=57600
attiny841opti.menu.clock.110external=11.0592 MHz (external)
attiny841opti.menu.clock.110external.bootloader.low_fuses=0xEE
attiny841opti.menu.clock.110external.build.f_cpu=11059200L
attiny841opti.menu.clock.110external.bootloader.file=optiboot/optiboot_attiny841at110.hex
attiny841opti.menu.clock.110external.upload.speed=115200
attiny841opti.menu.clock.147external=14.7456 MHz (external)
attiny841opti.menu.clock.147external.bootloader.low_fuses=0xEE
attiny841opti.menu.clock.147external.build.f_cpu=14745600L
attiny841opti.menu.clock.147external.bootloader.file=optiboot/optiboot_attiny841at147.hex
attiny841opti.menu.clock.147external.upload.speed=115200
attiny841opti.menu.clock.184external=18.432 MHz (external - overclocked)
attiny841opti.menu.clock.184external.bootloader.low_fuses=0xEE
attiny841opti.menu.clock.184external.build.f_cpu=18432000L
attiny841opti.menu.clock.184external.bootloader.file=optiboot/optiboot_attiny841at184.hex
attiny841opti.menu.clock.184external.upload.speed=115200
attiny841opti.menu.clock.20external=20 MHz (external - overclocked)
attiny841opti.menu.clock.20external.bootloader.low_fuses=0xEE
attiny841opti.menu.clock.20external.build.f_cpu=20000000L
attiny841opti.menu.clock.20external.bootloader.file=optiboot/optiboot_attiny841at20.hex
attiny841opti.menu.clock.20external.upload.speed=115200
attiny841opti.menu.bod.disable=B.O.D. Disabled
attiny841opti.menu.bod.disable.bootloader.extended_fuses=0xFE
attiny841opti.menu.bod.disable.bootloader.high_fuses=0xD7
attiny841opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny841opti.menu.bod.1v8.bootloader.extended_fuses=0xEC
attiny841opti.menu.bod.1v8.bootloader.high_fuses=0xD7
attiny841opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny841opti.menu.bod.2v7.bootloader.extended_fuses=0xEC
attiny841opti.menu.bod.2v7.bootloader.high_fuses=0xD5
attiny841opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny841opti.menu.bod.4v3.bootloader.extended_fuses=0xEC
attiny841opti.menu.bod.4v3.bootloader.high_fuses=0xD4


attiny828.name=ATtiny828 (No bootloader)
attiny828.upload.maximum_size=8192
attiny828.upload.maximum_data_size=512
attiny828.upload.tool=avrdude
attiny828.bootloader.tool=avrdude
attiny828.bootloader.unlock_bits=0x3F
attiny828.bootloader.lock_bits=0x3F
attiny828.build.mcu=attiny828
attiny828.build.core=tinymodern
attiny828.build.board=AVR_ATTINY828
attiny828.menu.clock.8internal=8 MHz (internal)
attiny828.menu.clock.8internal.bootloader.low_fuses=0xEE
attiny828.menu.clock.8internal.build.f_cpu=8000000L
attiny828.menu.clock.8internal.bootloader.file=empty/empty_all.hex
attiny828.menu.clock.1internal=1 MHz (internal)
attiny828.menu.clock.1internal.bootloader.low_fuses=0x6E
attiny828.menu.clock.1internal.build.f_cpu=1000000L
attiny828.menu.clock.1internal.bootloader.file=empty/empty_all.hex
attiny828.menu.bod.disable=Disabled
attiny828.menu.bod.disable.bootloader.extended_fuses=0xFF
attiny828.menu.bod.disable.bootloader.high_fuses=0xD7
attiny828.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny828.menu.bod.1v8.bootloader.extended_fuses=0x5F
attiny828.menu.bod.1v8.bootloader.high_fuses=0xD7
attiny828.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny828.menu.bod.2v7.bootloader.extended_fuses=0x5F
attiny828.menu.bod.2v7.bootloader.high_fuses=0xD5
attiny828.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny828.menu.bod.4v3.bootloader.extended_fuses=0x5F
attiny828.menu.bod.4v3.bootloader.high_fuses=0xD4


attiny828opti.name=ATtiny828 (Optiboot)
attiny828opti.upload.maximum_size=7680
attiny828opti.upload.maximum_data_size=512
attiny828opti.upload.protocol=arduino
attiny828opti.upload.speed=57600
attiny828opti.upload.tool=avrdude
attiny828opti.bootloader.tool=avrdude
attiny828opti.bootloader.unlock_bits=0x3F
attiny828opti.bootloader.lock_bits=0x3F
attiny828opti.build.mcu=attiny828
attiny828opti.build.core=tinymodern
attiny828opti.build.board=AVR_ATTINY828
attiny828opti.bootloader.low_fuses=0xEE
attiny828opti.menu.vcc.3v3=Under 4.0 V
attiny828opti.menu.vcc.3v3.build.f_cpu=8000000L
attiny828opti.menu.vcc.3v3.bootloader.file=optiboot/optiboot_attiny828at8.hex
attiny828opti.menu.vcc.5v=Over 4.0 V
attiny828opti.menu.vcc.5v.build.f_cpu=8200000L
attiny828opti.menu.vcc.5v.bootloader.file=optiboot/optiboot_attiny828at8_5v.hex
attiny828opti.menu.bod.disable=Disabled
attiny828opti.menu.bod.disable.bootloader.extended_fuses=0xFA
attiny828opti.menu.bod.disable.bootloader.high_fuses=0xD7
attiny828opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny828opti.menu.bod.1v8.bootloader.extended_fuses=0x5A
attiny828opti.menu.bod.1v8.bootloader.high_fuses=0xD7
attiny828opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny828opti.menu.bod.2v7.bootloader.extended_fuses=0x5A
attiny828opti.menu.bod.2v7.bootloader.high_fuses=0xD5
attiny828opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny828opti.menu.bod.4v3.bootloader.extended_fuses=0x5A
attiny828opti.menu.bod.4v3.bootloader.high_fuses=0xD4


