SpenceKonde/ATTinyCore/avr/boards.txt
attiny1634.name=ATtiny1634 (No bootloader)
attiny1634.upload.maximum_size=16384
attiny1634.upload.maximum_data_size=1024
attiny1634.upload.tool=avrdude
attiny1634.bootloader.tool=avrdude
attiny1634.bootloader.unlock_bits=0x03
attiny1634.bootloader.lock_bits=0x03
attiny1634.build.mcu=attiny1634
attiny1634.build.core=tinymodern
attiny1634.build.board=AVR_ATTINY1634
attiny1634.bootloader.extended_fuses=0x1F
attiny1634.bootloader.high_fuses=0xD7
attiny1634.menu.clock.8internal=8 MHz (internal)
attiny1634.menu.clock.8internal.bootloader.low_fuses=0xE2
attiny1634.menu.clock.8internal.build.f_cpu=8000000L
attiny1634.menu.clock.8internal.bootloader.file=empty/empty_all.hex
attiny1634.menu.clock.12external=12 MHz (external)
attiny1634.menu.clock.12external.bootloader.low_fuses=0xEF
attiny1634.menu.clock.12external.build.f_cpu=12000000L
attiny1634.menu.clock.12external.bootloader.file=empty/empty_all.hex
attiny1634.menu.clock.8external=8 MHz (external)
attiny1634.menu.clock.8external.bootloader.low_fuses=0xEF
attiny1634.menu.clock.8external.build.f_cpu=8000000L
attiny1634.menu.clock.8external.bootloader.file=empty/empty_all.hex
attiny1634.menu.clock.737external=7.372 MHz (external)
attiny1634.menu.clock.737external.bootloader.low_fuses=0xEE
attiny1634.menu.clock.737external.build.f_cpu=7372800L
attiny1634.menu.clock.737external.bootloader.file=empty/empty_all.hex
attiny1634.menu.clock.92external=9.216 MHz (external)
attiny1634.menu.clock.92external.bootloader.low_fuses=0xEE
attiny1634.menu.clock.92external.build.f_cpu=9216000L
attiny1634.menu.clock.92external.bootloader.file=empty/empty_all.hex
attiny1634.menu.clock.11external=11.0592 MHz (external)
attiny1634.menu.clock.11external.bootloader.low_fuses=0xEE
attiny1634.menu.clock.11external.build.f_cpu=11059200L
attiny1634.menu.clock.11external.bootloader.file=empty/empty_all.hex
attiny1634.menu.clock.143external=14.7456 MHz (external - overclocked)
attiny1634.menu.clock.143external.bootloader.low_fuses=0xEE
attiny1634.menu.clock.143external.build.f_cpu=14745600L
attiny1634.menu.clock.143external.bootloader.file=empty/empty_all.hex
attiny1634.menu.clock.6external=6 MHz (external)
attiny1634.menu.clock.6external.bootloader.low_fuses=0xEF
attiny1634.menu.clock.6external.build.f_cpu=6000000L
attiny1634.menu.clock.6external.bootloader.file=empty/empty_all.hex
attiny1634.menu.clock.4external=4 MHz (external)
attiny1634.menu.clock.4external.bootloader.low_fuses=0xEF
attiny1634.menu.clock.4external.build.f_cpu=6000000L
attiny1634.menu.clock.4external.bootloader.file=empty/empty_all.hex
attiny1634.menu.clock.1internal=1 MHz (internal)
attiny1634.menu.clock.1internal.bootloader.low_fuses=0x62
attiny1634.menu.clock.1internal.build.f_cpu=1000000L
attiny1634.menu.clock.1internal.bootloader.file=empty/empty_all.hex
attiny1634.menu.clock.16external=16 MHz (external - overclocked)
attiny1634.menu.clock.16external.bootloader.low_fuses=0xEF
attiny1634.menu.clock.16external.build.f_cpu=16000000L
attiny1634.menu.clock.16external.bootloader.file=empty/empty_all.hex
attiny1634.menu.bod.disable=Disabled
attiny1634.menu.bod.disable.bootloader.extended_fuses=0x1F
attiny1634.menu.bod.disable.bootloader.high_fuses=0xD7
attiny1634.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny1634.menu.bod.1v8.bootloader.extended_fuses=0x1D
attiny1634.menu.bod.1v8.bootloader.high_fuses=0xD7
attiny1634.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny1634.menu.bod.2v7.bootloader.extended_fuses=0x1D
attiny1634.menu.bod.2v7.bootloader.high_fuses=0xD5
attiny1634.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny1634.menu.bod.4v3.bootloader.extended_fuses=0x1D
attiny1634.menu.bod.4v3.bootloader.high_fuses=0xD4

attiny1634opti.name=ATtiny1634 (Optiboot)
attiny1634opti.upload.maximum_size=15744
attiny1634opti.upload.maximum_data_size=1024
attiny1634opti.upload.protocol=arduino
attiny1634opti.upload.tool=avrdude
attiny1634opti.bootloader.tool=avrdude
attiny1634opti.bootloader.unlock_bits=0x03
attiny1634opti.bootloader.lock_bits=0x03
attiny1634opti.build.mcu=attiny1634
attiny1634opti.build.core=tinymodern
attiny1634opti.build.board=AVR_ATTINY1634_OPTIBOOT
attiny1634opti.bootloader.extended_fuses=0x1F
attiny1634opti.bootloader.high_fuses=0xD7
attiny1634opti.menu.clock.8internal=8 MHz (internal)
attiny1634opti.menu.clock.8internal.bootloader.low_fuses=0xE2
attiny1634opti.menu.clock.8internal.build.f_cpu=8000000L
attiny1634opti.menu.clock.8internal.bootloader.file=optiboot/optiboot_attiny1634at8.hex
attiny1634opti.menu.clock.8internal.upload.speed=57600
attiny1634opti.menu.clock.12external=12 MHz (external)
attiny1634opti.menu.clock.12external.bootloader.low_fuses=0xEF
attiny1634opti.menu.clock.12external.build.f_cpu=12000000L
attiny1634opti.menu.clock.12external.bootloader.file=optiboot/optiboot_attiny1634at12.hex
attiny1634opti.menu.clock.12external.upload.speed=115200
attiny1634opti.menu.clock.8external=8 MHz (external)
attiny1634opti.menu.clock.8external.bootloader.low_fuses=0xEF
attiny1634opti.menu.clock.8external.build.f_cpu=8000000L
attiny1634opti.menu.clock.8external.bootloader.file=optiboot/optiboot_attiny1634at8.hex
attiny1634opti.menu.clock.8external.upload.speed=57600
attiny1634opti.menu.clock.8internal5v=8 MHz (internal, Vcc > 4v)
attiny1634opti.menu.clock.8internal5v.bootloader.low_fuses=0xE2
attiny1634opti.menu.clock.8internal5v.build.f_cpu=8200000L
attiny1634opti.menu.clock.8internal5v.bootloader.file=optiboot/optiboot_attiny1634at8_5v.hex
attiny1634opti.menu.clock.8internal5v.upload.speed=57600
attiny1634opti.menu.clock.737external=7.3728 MHz (external)
attiny1634opti.menu.clock.737external.bootloader.low_fuses=0xEF
attiny1634opti.menu.clock.737external.build.f_cpu=7372800L
attiny1634opti.menu.clock.737external.bootloader.file=optiboot/optiboot_attiny1634at737.hex
attiny1634opti.menu.clock.737external.upload.speed=57600
attiny1634opti.menu.clock.921external=9.216 MHz (external)
attiny1634opti.menu.clock.921external.bootloader.low_fuses=0xEF
attiny1634opti.menu.clock.921external.build.f_cpu=9216000L
attiny1634opti.menu.clock.921external.bootloader.file=optiboot/optiboot_attiny1634at921.hex
attiny1634opti.menu.clock.921external.upload.speed=57600
attiny1634opti.menu.clock.110external=11.059 MHz (external)
attiny1634opti.menu.clock.110external.bootloader.low_fuses=0xEF
attiny1634opti.menu.clock.110external.build.f_cpu=11059200L
attiny1634opti.menu.clock.110external.bootloader.file=optiboot/optiboot_attiny1634at110.hex
attiny1634opti.menu.clock.110external.upload.speed=115200
attiny1634opti.menu.clock.147external=14.7456 MHz (external - overclocked)
attiny1634opti.menu.clock.147external.bootloader.low_fuses=0xEF
attiny1634opti.menu.clock.147external.build.f_cpu=14745600L
attiny1634opti.menu.clock.147external.bootloader.file=optiboot/optiboot_attiny1634at147.hex
attiny1634opti.menu.clock.147external.upload.speed=115200
attiny1634opti.menu.clock.16external=16 MHz (external - overclocked)
attiny1634opti.menu.clock.16external.bootloader.low_fuses=0xEF
attiny1634opti.menu.clock.16external.build.f_cpu=16000000L
attiny1634opti.menu.clock.16external.bootloader.file=optiboot/optiboot_attiny1634at16.hex
attiny1634opti.menu.clock.16external.upload.speed=115200
attiny1634opti.menu.bod.disable=B.O.D. Disabled
attiny1634opti.menu.bod.disable.bootloader.extended_fuses=0x1E
attiny1634opti.menu.bod.disable.bootloader.high_fuses=0xD7
attiny1634opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny1634opti.menu.bod.1v8.bootloader.extended_fuses=0x1C
attiny1634opti.menu.bod.1v8.bootloader.high_fuses=0xD7
attiny1634opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny1634opti.menu.bod.2v7.bootloader.extended_fuses=0x1C
attiny1634opti.menu.bod.2v7.bootloader.high_fuses=0xD5
attiny1634opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny1634opti.menu.bod.4v3.bootloader.extended_fuses=0x1C
attiny1634opti.menu.bod.4v3.bootloader.high_fuses=0xD4


attinyx313.name=ATtiny2313/4313
attinyx313.upload.maximum_size=4096
attinyx313.upload.maximum_data_size=256
attinyx313.upload.tool=avrdude
attinyx313.bootloader.tool=avrdude
attinyx313.bootloader.unlock_bits=0x3F
attinyx313.bootloader.lock_bits=0x3F
attinyx313.build.core=tiny
attinyx313.build.board=AVR_ATTINYX313
attinyx313.bootloader.extended_fuses=0xFF
attinyx313.menu.chip.4313=ATtiny4313
attinyx313.menu.chip.4313.build.mcu=attiny4313
attinyx313.menu.chip.4313.upload.maximum_size=4096
attinyx313.menu.chip.4313.upload.maximum_data_size=256
attinyx313.menu.chip.2313=ATtiny2313
attinyx313.menu.chip.2313.build.mcu=attiny2313
attinyx313.menu.chip.2313.upload.maximum_size=2048
attinyx313.menu.chip.2313.upload.maximum_data_size=128
attinyx313.menu.clock.8internal=8 MHz (internal)
attinyx313.menu.clock.8internal.bootloader.low_fuses=0xE4
attinyx313.menu.clock.8internal.build.f_cpu=8000000L
attinyx313.menu.clock.8internal.bootloader.file=empty/empty_all.hex
attinyx313.menu.clock.20external=20 MHz (external)
attinyx313.menu.clock.20external.bootloader.low_fuses=0xFF
attinyx313.menu.clock.20external.build.f_cpu=20000000L
attinyx313.menu.clock.20external.bootloader.file=empty/empty_all.hex
attinyx313.menu.clock.16external=16 MHz (external)
attinyx313.menu.clock.16external.bootloader.low_fuses=0xFF
attinyx313.menu.clock.16external.build.f_cpu=16000000L
attinyx313.menu.clock.16external.bootloader.file=empty/empty_all.hex
attinyx313.menu.clock.12external=12 MHz (external)
attinyx313.menu.clock.12external.bootloader.low_fuses=0xFF
attinyx313.menu.clock.12external.build.f_cpu=12000000L
attinyx313.menu.clock.12external.bootloader.file=empty/empty_all.hex
attinyx313.menu.clock.8external=8 MHz (external)
attinyx313.menu.clock.8external.bootloader.low_fuses=0xFF
attinyx313.menu.clock.8external.build.f_cpu=8000000L
attinyx313.menu.clock.8external.bootloader.file=empty/empty_all.hex
attinyx313.menu.clock.1internal=1 MHz (internal)
attinyx313.menu.clock.1internal.bootloader.low_fuses=0x64
attinyx313.menu.clock.1internal.build.f_cpu=1000000L
attinyx313.menu.clock.1internal.bootloader.file=empty/empty_all.hex
attinyx313.menu.clock.4internal=4 MHz (internal)
attinyx313.menu.clock.4internal.bootloader.low_fuses=0xE2
attinyx313.menu.clock.4internal.build.f_cpu=4000000L
attinyx313.menu.clock.4internal.bootloader.file=empty/empty_all.hex
attinyx313.menu.clock.6external=6 MHz (external)
attinyx313.menu.clock.6external.bootloader.low_fuses=0xFD
attinyx313.menu.clock.6external.build.f_cpu=6000000L
attinyx313.menu.clock.6external.bootloader.file=empty/empty_all.hex
attinyx313.menu.clock.4external=4 MHz (external)
attinyx313.menu.clock.4external.bootloader.low_fuses=0xFD
attinyx313.menu.clock.4external.build.f_cpu=4000000L
attinyx313.menu.clock.4external.bootloader.file=empty/empty_all.hex
attinyx313.menu.clock.5internal=0.5 MHz (internal)
attinyx313.menu.clock.5internal.bootloader.low_fuses=0x62
attinyx313.menu.clock.5internal.build.f_cpu=500000L
attinyx313.menu.clock.5internal.bootloader.file=empty/empty_all.hex
attinyx313.menu.bod.disable=B.O.D. Disabled
attinyx313.menu.bod.disable.bootloader.high_fuses=0x9F
attinyx313.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx313.menu.bod.1v8.bootloader.high_fuses=0x9D
attinyx313.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx313.menu.bod.2v7.bootloader.high_fuses=0x9B
attinyx313.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx313.menu.bod.4v3.bootloader.high_fuses=0x99
attinyx313.menu.INITIALIZE_SECONDARY_TIMERS.0=no
attinyx313.menu.INITIALIZE_SECONDARY_TIMERS.1=yes
attinyx313.menu.INITIALIZE_SECONDARY_TIMERS.1.build.extra_flags=-DINITIALIZE_SECONDARY_TIMERS=1
attinyx313.build.variant=tinyX313

attiny26.name=ATtiny26
attiny26.upload.maximum_size=8192
attiny26.upload.maximum_data_size=512
attiny26.upload.tool=avrdude
attiny26.build.board=AVR_ATTINY26
attiny26.bootloader.tool=avrdude
attiny26.bootloader.unlock_bits=0x03
attiny26.bootloader.lock_bits=0x03
attiny26.build.mcu=attiny26
attiny26.build.core=tiny
attiny26.menu.TimerClockSource.default=CPU
attiny26.menu.TimerClockSource.pll=64MHz
attiny26.menu.TimerClockSource.pll.build.extra_flags=-DPLLTIMER1
attiny26.bootloader.extended_fuses=0x01
attiny26.menu.clock.8internal=8 MHz (internal)
attiny26.menu.clock.8internal.bootloader.low_fuses=0xE2
attiny26.menu.clock.8internal.build.f_cpu=8000000L
attiny26.menu.clock.8internal.bootloader.file=empty/empty_all.hex
attiny26.menu.clock.20external=20 MHz (external)
attiny26.menu.clock.20external.bootloader.low_fuses=0xFF
attiny26.menu.clock.20external.build.f_cpu=20000000L
attiny26.menu.clock.20external.bootloader.file=empty/empty_all.hex
attiny26.menu.clock.16external=16 MHz (external)
attiny26.menu.clock.16external.bootloader.low_fuses=0xFF
attiny26.menu.clock.16external.build.f_cpu=16000000L
attiny26.menu.clock.16external.bootloader.file=empty/empty_all.hex
attiny26.menu.clock.16pll=16 MHz (PLL)
attiny26.menu.clock.16pll.bootloader.low_fuses=0xF1
attiny26.menu.clock.16pll.build.f_cpu=16000000L
attiny26.menu.clock.16pll.bootloader.file=empty/empty_all.hex
attiny26.menu.clock.12external=12 MHz (external)
attiny26.menu.clock.12external.bootloader.low_fuses=0xFF
attiny26.menu.clock.12external.build.f_cpu=12000000L
attiny26.menu.clock.12external.bootloader.file=empty/empty_all.hex
attiny26.menu.clock.8external=8 MHz (external)
attiny26.menu.clock.8external.bootloader.low_fuses=0xFF
attiny26.menu.clock.8external.build.f_cpu=8000000L
attiny26.menu.clock.8external.bootloader.file=empty/empty_all.hex
attiny26.menu.clock.6external=6 MHz (external)
attiny26.menu.clock.6external.bootloader.low_fuses=0xFD
attiny26.menu.clock.6external.build.f_cpu=6000000L
attiny26.menu.clock.6external.bootloader.file=empty/empty_all.hex
attiny26.menu.clock.4external=4 MHz (external)
attiny26.menu.clock.4external.bootloader.low_fuses=0xFD
attiny26.menu.clock.4external.build.f_cpu=4000000L
attiny26.menu.clock.4external.bootloader.file=empty/empty_all.hex
attiny26.menu.clock.4internal=4 MHz (internal)
attiny26.menu.clock.4internal.bootloader.low_fuses=0xFD
attiny26.menu.clock.4internal.build.f_cpu=4000000L
attiny26.menu.clock.4internal.bootloader.file=empty/empty_all.hex
attiny26.menu.clock.2internal=2 MHz (internal)
attiny26.menu.clock.2internal.bootloader.low_fuses=0xFF
attiny26.menu.clock.2internal.build.f_cpu=2000000L
attiny26.menu.clock.2internal.bootloader.file=empty/empty_all.hex
attiny26.menu.clock.1internal=1 MHz (internal)
attiny26.menu.clock.1internal.bootloader.low_fuses=0x62
attiny26.menu.clock.1internal.build.f_cpu=1000000L
attiny26.menu.clock.1internal.bootloader.file=empty/empty_all.hex
attiny26.menu.bod.disable=B.O.D. Disabled
attiny26.menu.bod.disable.bootloader.high_fuses=0xD7
attiny26.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny26.menu.bod.1v8.bootloader.high_fuses=0xD6
attiny26.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny26.menu.bod.2v7.bootloader.high_fuses=0xD5
attiny26.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny26.menu.bod.4v3.bootloader.high_fuses=0xD4
attiny26.build.variant=tiny26